import { useState } from 'react'
import { Header } from "./Header.jsx";
import { Baner } from "./Baner.jsx";
import { ContactForm } from './ContactForm.jsx'; 

import { VscAccount } from "react-icons/vsc";
import { HiOutlineClipboardDocumentCheck } from "react-icons/hi2";
import { TbNumber10Small } from "react-icons/tb";
import { TbNumber40Small } from "react-icons/tb";



// import reactLogo from './assets/react.svg'
// import viteLogo from '/vite.svg'

function App() {
  // const [count, setCount] = useState(0)

  return (
    <>
      {/* <Header /> */}
      <Baner />
      <div className='all-app'>
        <div>
          <p>שמי שרי מילר<br />
            גרה בבית שמש</p>
          <ul>
            <li>
              מנחה באורינות ובמתמטיקה. מנחת סימנריסטיות
              <span className="li-icon">
                <VscAccount />
              </span>
            </li>

            <li>וותק בחינוך 40 שנה
              <span className="li-icon">
                <TbNumber40Small />

              </span>
            </li>
            <li>מאמנת, קואוצ'רית, N.L.P סיביט מיינדפולנס ועוד
              <span className="li-icon">
                <HiOutlineClipboardDocumentCheck />
              </span>
            </li>
            <li>נסיון מעשי למעלה מ10 שנים
              <span className="li-icon">
                <TbNumber10Small />


              </span>
            </li>
            <li>שילוב האימון עם הנחית הורים
              <span className="li-icon">
                <VscAccount />
              </span>
            </li>
            <li>מתמחה בקשב ובריכוז
              <span className="li-icon">
                <VscAccount />
              </span>
            </li>
            <li>מיקוד מטרה ל'שבירת תקרות זכוכית
              <span className="li-icon">
                <VscAccount />
              </span>
            </li>
          </ul>
        </div>
        <div className='examples'>
          <h2>דוגמאות מעשיות</h2>
          <div className='all-examples'>
            <p>
              נער בן 11 מאחר יום יום לבית הספר במשך חודשים, מגיע בסביבות 12.00 לבית הספר.
              לא הועילו דיבורים, מבצעים, עונשים, הרחקות והורים.
              האיחורים הללו 'ציננו את האמבטיה הכיתית' וגררו ילדים אחרים לזלזל בכלל הברזל של הגעה בזמן ובכלל במשמעת ובכבוד לדברי המחנך והמנהל.
              גם כניסת תו הפריע למהלך התקין של השיעור.
              התאמנו על העצמה אישית, חוזקות, ערכים, עיוותי חשיבה וניהול זמן נכון.
              הקנית אסטרטגיות, כלים. סיפוק ועונג מההצלחות.
              עד עתה המנהל לא מאמין שהנער לא נוטל כדור רפואי כלשהוא.
              יש בידי את הקלטת השיחה.
              הסדר והמשמעת הנורמטיבית חזרה לתיקנה.

            </p>
            <p>
              נערה בת 12 הגיעה לבית הספר בלית ברירה. לא למדה, לא  הכינה שעורים, הפריעה, נכשלה ברוב המבחנים.
              היא רכשה חברה תלותית וניצלה אותה למעשי קונדס ולהתחצפויות שונות ומשונות.
              באימון הפרטני עבדנו על הזהות שלי עצמי, מי אני. כוחות ומשאבים, פיתוח כישורים חברתיים נכונים וטובים.
              רגיעה כללית שבה לכיתה,  המריבות והתככים פסקו.

            </p>
          </div>

        </div>
        <div className='recommendations'>
          <h2>המלצות</h2>
          <div className='all-recommendations'>
            <p>
              ש. ר.
              איך מתחילים בכלל לכתוב מכתב תודה על ילד חדש שהענקת לנו במתנה?
              תודה על המון כוחות פנימיים שהענקת לבן שלנו. על חוסן מדהים לגילו.
              תודה על ליווי צמוד לנו, מעל ומעבר לכל המתבקש והמצופה.

            </p>
            <p>
              מ.ה.
              כשהגענו בתחילת הדרך, הייתי די נסערת וחוששת ממה שעובר על הבת שלנו.
              מצד שני גם אם ואיך לטפל
              וגם למודת אכזבה ממטפלות בבר.
              ב"ה ישר הרגשנו שהגענו למקום הנכון.
              באמת הדברים הם לא סוף העולם ובטיפול נכון הכל יעלה על דרך המלך
              ושאת כאן איתנו, כל הזמן לשאלה, להדרכה, לתת בטחון בהתנהלות שלנו.
              תודה רבה!

            </p>

            <p>
              ש.א.
              תודה על הטיפול. אנשים פה בישוב החדש שואלים בטח קשה המעבר. אנחנו לא מספרים מה היה לנו במקום המגורים הקודם. אני חשבתי לעצמי לא יכול להיות יותר גרוע מבחינה חברתית.
              (הנערה התבודדה, לא היתה לה אף חברה, לא טלפונים, לא מפגשים)
              ועכשו היא 'בשבת ארגון'  של תנועת הנוער. זה לא היה בעבר.
              יישר כח גדול
              נ.ב. אפילו השיער כבר לא מכסה את רוב הפנים כדי שתוכל להסתתר אלא אסוף.

            </p>
            <p>
              י.כ.
              בלעדייך לא הייתי מגיע למקום שאני נמצאת עכשו.
              כל יום כל יום אני זוכרת אותך
              ושאני באה להתפוצץ על מישהו אני חושבת עלייך ואומרת לעצמי...

            </p>
            <p>
              ב. א, י.
              עברו חמש שנים מהאימון שלנו. אני עדין מתאמנת ומתרגלת את הכלים שנתת לי
              למיקוד מטרה, להתגבר על הסחות.
              היום אני בכיתה ז', בהקבצה א', וקל לי להיות מרוכזת ולהנות מאד מאד מהלימודים.
              תודה על הכל. לא אשכח אותך. תמיד זוכרת.

            </p>
            <p>
              נ. ח.
              אני מצליחה להתגבר על כעסים והתפרצויות.
              אני כבר לא מעירה לחברות כל מיני הערות. זה לא קשור אלי. אני לא אמא שלהם.
              אני גם מצליחה לא לעשות פרצופים.
              אני מרגישה יותר טוב עם עצמי ויש לי שתי חברות ממש טובות ועוד חברות.
              בנות מזמינות אותי למסיבות בת מצוה שלהן.
              תודה רבה לך שרי.

            </p>
          </div>

        </div>

      </div>
      <ContactForm />

    </>
  )
}

export default App
