export function Baner() {
    return (

        <div>   
            <div className="first">
                <h1>איך בית ספרכם יהנה מיכולת הטיפול הפרטני שלי?</h1>
                <h2>מנהל-ת יקר-ה!<br />
                    אם גם אצלך יש ילדה מתמרדת הגוררת חברות עמה.<br />
                    או ילד המפר כללי משמעת באופן בוטה והמורה לא יכול להישאר מיושב ולנהל השיעור כראוי.<br />
                    או איחורים מוגזמים קבועים ולא עוזר שיחות, עונשים והורים.</h2>
            </div>
        </div>

    )
}